app/Controllers/clientesController.php

SELECT *
FROM `cliente`
---
    public function verClientes() {
        $cliente = new Clientes();
        $datosBD['datosBD'] = $cliente->findAll();