app/Controllers/generoController.php

    public function verGeneros() {
        $genero = new Generos();
        $datosBD['generos'] = $genero->findAll();
---
SELECT *
FROM `genero`

    public function localizarGenero($id = null) {
        $genero = new Generos();
        $datosGenero['datosGenero'] = $genero->where('id_genero', $id)->first();
---
SELECT *
FROM `genero`
WHERE `id_genero` = '1'
 LIMIT 1