app/Controllers/LoginController.php

    public function verificar()
    {
        $correo = $this->request->getPost('nombre_usuario');
        $password = $this->request->getPost('contraseña');

        $usuarioModel = new UsuarioModel();
        $usuario = $usuarioModel->where('nombre_usuario', $correo)->first();
---
SELECT *
FROM `usuario`
WHERE `nombre_usuario` = 'admin@fetiche.com'
 LIMIT 1