app/Controllers/perfumesController.php

SELECT *
FROM `perfume`
SELECT *
FROM `genero`
---
    public function verPerfumes() {
        $perfume = new Perfumes();
        $datosBD['perfumes'] = $perfume->findAll();

        // También puedes cargar los géneros si quieres mostrar el nombre en vez del ID
        $genero = new Generos();
        $datosBD['generos'] = $genero->findAll();

SELECT *
FROM `genero`
---
    public function formularioNuevo() {
    $genero = new Generos();
    $datos['generos'] = $genero->findAll(); // Para llenar el select de género

SELECT *
FROM `perfume`
WHERE `id_perfume` = '1'
 LIMIT 1
SELECT *
FROM `genero`
---
    public function localizarPerfume($id = null) {
    $modelo = new Perfumes();
    $datos['perfume'] = $modelo->where('id_perfume', $id)->first();

    $genero = new Generos();
    $datos['generos'] = $genero->findAll();