app/Controllers/usuariosController.php

    public function verUsuarios() {
        $usuario = new Usuarios();
        $datosBD['usuarios'] = $usuario->findAll();
---
SELECT *
FROM `usuario`

    public function localizarUsuario($id = null) {
        $usuario = new Usuarios();
        $datosUsuario['datosUsuario'] = $usuario->where('id_usuario', $id)->first();
---
SELECT *
FROM `usuario`
WHERE `id_usuario` = '1'
 LIMIT 1