app/Controllers/ventasController.php

SELECT *
FROM `venta`
SELECT *
FROM `cliente`
---
    public function verVentas() {
        $venta = new Ventas();
        $datosBD['ventas'] = $venta->findAll();

        // También puedes cargar los clientes para mostrar nombres en vez de IDs
        $cliente = new Clientes();
        $datosBD['clientes'] = $cliente->findAll();